<a href="https://colab.research.google.com/github/risker93/Hello_World/blob/main/2021_06_09_%EC%BA%90%EA%B8%80%EC%A0%84%EC%A0%95%EB%A6%AC_%EC%88%98%EC%97%85_1.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

**인공지능과 머신러닝**

컴퓨터는 1부터 10까지 다 해줘야 한다,

인간처럼 지능을 가지고, 컴퓨터가 알아서 하는 방법이 없을까?, 컴퓨터가 알아서 배워서 일을 할수 없을까?

그래서 그렇게 만들어 보기로 했다.

사람과 유사하게 = 인공지능, 기계가 학습한다 = 기계학습(머신러닝)

**왜 머신러닝 인공지능에서 판다스와 파이썬을 배워야 하는가?**

현재 우리가 인공지능을 다룰때 기계가 학습하기위해 데이터를 다룬다, 이 데이터는 양이 엄청나게 많다.

이 데이터를 사용하기 위해서 쓰기 편하게 만들어 줘야 한다.

리스트와 딕셔너리를 시리즈와 데이터프레임으로 바꾸는 방법은 기본적으로 알아야한다.

    sr.index
    sr.values

In [7]:
import pandas as pd

a = [1,2,3,4]
b = [4,5,6,7]

sr = pd.Series(a)

print(sr)
print(sr.index)
print(sr.values)

0    1
1    2
2    3
3    4
dtype: int64
RangeIndex(start=0, stop=4, step=1)
[1 2 3 4]

.index 와 .values 를 언급해서 한번 시리즈 객체를 만들어 출력해 보았다.

두개 이상 데이터를 추출할때는 리스트를 넣어준다.

In [6]:
print(sr[[0,1]])

0    1
1    2
dtype: int64

**인덱스 배열 조회!!!!!** **중요하다!*******

행 인덱스 배열 조회 
    df.index

열 인덱스 배열 조회
    df.columns #정말 많이 쓴다 !!!!!

데이터프레임 행 조회 loc, iloc

- loc : 인덱스 이름을 기준으로
- iloc: 정수형 인덱스를 기준으로

[1:3] 파이썬에서 슬라이싱을 할때 3이 포함되지 않는다.

- loc: 끝 포함
- iloc: 끝 제외

df.loc['실행', : ] 행은 실행, 열은 전부 

df.iloc[1, : ] 

loc, iloc를 사용 할때는 행과 열을 모두 적어주자!

df.loc[ : , '실행'] ('실행' 이 포함됨.)

df.loc[ : , '실행', : ] (행은 처음부터 '실행' 까지, 열은 처음부터 끝까지)

df.iloc[ : , 1] (1번 인덱스가 포함이 안됨)

In [11]:
df = pd.DataFrame({0: a, 1: b})
df

   0  1
0  1  4
1  2  5
2  3  6
3  4  7

In [14]:
df.index

RangeIndex(start=0, stop=4, step=1)

In [19]:
df.columns = ['컬럼1','컬럼2']
df

   컬럼1  컬럼2
0    1    4
1    2    5
2    3    6
3    4    7

In [27]:
df.loc[0:1]

   컬럼1  컬럼2
0    1    4
1    2    5

In [26]:
df.iloc[0:1]

   컬럼1  컬럼2
0    1    4

df['수학'] : 시리즈 객체로 나온다

df[['수학']]: 데이터프레임으로 나온다

In [34]:
df['컬럼1']

0    1
1    2
2    3
3    4
Name: 컬럼1, dtype: int64

In [35]:
df[['컬럼1']]

   컬럼1
0    1
1    2
2    3
3    4

df.loc['컬럼1'] : 에러가 나온다. loc, iloc는 인덱스가 기준이다.

df.loc[ : , '컬럼'] 이렇게 적어주면 에러가 나오지 않는다.

In [36]:
df.loc[:, '컬럼1']

0    1
1    2
2    3
3    4
Name: 컬럼1, dtype: int64

In [38]:
#이렇게 새로운 컬럼을 만들수 있다.
df['국사'] = [7,8,9,10]
df

   컬럼1  컬럼2  국사
0    1    4   7
1    2    5   8
2    3    6   9
3    4    7  10

1개만 넣으면 모두 동일한 값이 들어간다, 개수가 다르면 에러가 난다.

**df.rename()** #열 이름 하나 정도 바꿀때 사용한다

(1) pandas DataFrame의 칼럼 이름 바꾸기

    :  df.columns = ['a', 'b']

    :  df.rename(columns = {'old_nm' : 'new_nm'}, inplace = True)

(2) pandas DataFrame의 인덱스 이름 바꾸기

    : df.index = ['a', 'b']

    : df.rename(index = {'old_nm': 'new_nm'}, inplace = True)


출처: https://rfriend.tistory.com/468 [R, Python 분석과 프로그래밍의 친구 (by R Friend)]

**set_index()**

딕셔너리로 들어온 열중에 인덱스로 설정하고 싶은 열이 있을떄 사용, 인덱스를 2개 넣을수도 있다.

    DataFrame.set_index(keys, drop=True, append=False, inplace=False, verify_integrity=False)

**.transpose() == .T 중요!!!!!**

데이터를 볼때 행과 열을 바꿔서 보는게 더 편할경우 사용한다.

In [46]:
df2

   컬럼1  컬럼2  국사
0    1    4   7
1    2    5   8
2    3    6   9
3    4    7  10

In [42]:
df2 = df.T
df2

     0  1  2   3
컬럼1  1  2  3   4
컬럼2  4  5  6   7
국사   7  8  9  10

In [44]:
df2 = df.T.T
df2

   컬럼1  컬럼2  국사
0    1    4   7
1    2    5   8
2    3    6   9
3    4    7  10

reset_index() : 인덱스 초기화

컬럼명이 되고 인덱스가 값으로 면함.

In [50]:
df2.T.reset_index()

  index  0  1  2   3
0   컬럼1  1  2  3   4
1   컬럼2  4  5  6   7
2    국사  7  8  9  10

In [51]:
df2.T.reset_index(drop=True)

   0  1  2   3
0  1  2  3   4
1  4  5  6   7
2  7  8  9  10

In [52]:
df2

   컬럼1  컬럼2  국사
0    1    4   7
1    2    5   8
2    3    6   9
3    4    7  10

sort_index(), sort_values() : 인덱스와 컬럼을 정렬하는 함수.

csv 파일을 읽을때 컬럼 이름이 없는 경우에는 읽어들일때 header=None 옵션을 준다,

그 후 df.columns = ['A', 'B', 'C', 'D'] 이런식으로 컬럼명을 만들어 주면된다.

**데이터프레임 구조 확인**

df.head()

df.info()

df.describe()

**데이터 개수 확인**

count()

df['열'].value_counts()

In [54]:
df2['컬럼1'].value_counts()

4    1
3    1
2    1
1    1
Name: 컬럼1, dtype: int64

**통계함수 적용**

df.median() : 중간값

df.corr(): 상관계수를 계산

**변수간 스케일 조정(scaling)**

어떤 컬럼은 1~10, 어떤 컬럼은 1~10000사이의 값일때, 컴퓨터는 큰 값이 더 중요하다고 생각할 수 있다.

따라서 동등한 범위로 만들어주는 스케일이 필요하다.

Standard(정규분포를 따를 때만 써야한다)

Min-Max(결측치를 채울때 중간값으로 채울지, 평균값으로 채울지 선택해야 한다. 이상치가 있다면 정확도가 떨어질 수 있다.)

Robust(최대값, 최소값을 없앴다.)

Normalize

이 방식들 중 하나 하나 적용해 보면서 최적의 방식을 찾아 나가는 과정이 필요하다.

전처리의 시작은 누락데이터(NaN) 제거에서 시작한다.

1. NaN확인
2. NaN제거 및 치환
3. 중복데이터 확인
4. 중복데이터 제거